оперативныйучет2/src/Enums/ХозяйственныеОперации/ХозяйственныеОперации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="351b0c5b-74c3-4aaa-a93b-7246b941f797">
  <name>ХозяйственныеОперации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="6982524e-4873-4f26-b5f2-355851663d52">
    <name>ЗакупкаУПоставщика</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76156fda-6b2e-4da7-871d-49dfc4840df3">
    <name>ПриемНаКомиссию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="82c175ad-99c1-4f74-9ddb-eab46549ef7c">
    <name>ПередачаПереработчику2_5</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

оперативныйучет2/src/Documents/оуп_ПакетДокументовПередачиПереработчику/оуп_ПакетДокументовПередачиПереработчику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>оуп_ПакетДокументовПередачиПереработчику</name>
  <attributes>
    <name>ОрганизацияОтправитель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Переработчик</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПереработки</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерДавалец</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорПоступления</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Документы</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ПриобретениеТоваровУслуг</types>
        <types>DocumentRef.ПередачаТоваровХранителю</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

оперативныйучет2/src/CommonModules/оуп_ПередачаВПереработкуВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс
Функция ЗаполнитьСтруктуруПараметровДокументПереработки(Документ)  Экспорт 
	если Ложь тогда 
		Документ = документы.оуп_ПакетДокументовПередачиПереработчику.СоздатьДокумент();		
	КонецЕсли;
	
	//@skip-check structure-consructor-too-many-keys
	сткНастройки = новый Структура("Организация, Партнер, Договор, Склад, ХозяйственнаяОперация", 
	Документ.ОрганизацияОтправитель, 
	Документ.Переработчик, 
	Документ.ДоговорПереработки, 
	Документ.СкладОтправитель,
	Перечисления.ХозяйственныеОперации.ПередачаПереработчику2_5
	);
		
	Возврат сткНастройки
	
КонецФункции // ЗаполнитьСтруктуруПараметровДокументПереработки()

Функция ЗаполнитьСтруктуруПараметровДокументПоступления(Документ) Экспорт
	если Ложь Тогда
		Документ = документы.оуп_ПакетДокументовПередачиПереработчику.СоздатьДокумент();
	КонецЕсли;
	 
	
	сткНастройки = новый Структура("Организация, Партнер, Договор, Склад", 
	Документ.ОрганизацияПолучатель, 
	Документ.ПартнерДавалец, 
	Документ.ДоговорПоступления, 
	Документ.СкладПолучатель
	);
	
	
	Возврат сткНастройки
	
КонецФункции // ЗаполнитьСтруктуруПараметровДокументПереработки()

Функция СформироватьДокументПередачи(Параметры, ПакетДокументов) Экспорт
	возврат оуп_ПередачаВПереработку.СформироватьДокументПередачи(Параметры, ПакетДокументов)	;
КонецФункции

Функция СформироватьДокументПоступления(Параметры, тчТовары) Экспорт
	возврат оуп_ПередачаВПереработку.СформироватьДокументПоступления(Параметры, тчТовары);
КонецФункции

Функция имяФункции(Параметры) Экспорт
	возврат оуп_ПередачаВПереработку.ПолучитьОстаткиДляПередачиВПереработку(Параметры);
КонецФункции

#КонецОбласти
